madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
/*
 * Copyright (c) 2019 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <nrf_modem_at.h>
#include <nrf_modem_gnss.h>
#include <modem/lte_lc.h>
#include <modem/nrf_modem_lib.h>
#include <date_time.h>

LOG_MODULE_REGISTER(gnss_sample, CONFIG_GNSS_SAMPLE_LOG_LEVEL);



#include <zephyr/drivers/i2c.h>








#define SSD1306_I2C_ADDR 0x3D // Adresse I2C typique pour SSD1306

// Fonction pour envoyer une commande à l'écran
static int ssd1306_write_cmd(const struct device *i2c_dev, uint8_t cmd) {
    uint8_t buf[2] = {0x00, cmd}; // 0x00 = Control byte pour commande
    return i2c_write(i2c_dev, buf, 2, SSD1306_I2C_ADDR);
}

// Fonction pour envoyer des données (pixels)
static int ssd1306_write_data(const struct device *i2c_dev, uint8_t data) {
    uint8_t buf[2] = {0x40, data}; // 0x40 = Control byte pour data
    return i2c_write(i2c_dev, buf, 2, SSD1306_I2C_ADDR);
}


static uint8_t framebuffer[128][8] = {0}; // 128 colonnes x 4 pages (pour 128x32)






void allumer_pixel(const struct device *i2c_dev, uint8_t x, uint8_t y) {
    if (x >= 128 || y >= 64) return;
    //extern uint8_t framebuffer[128][4]; // ou déclare-le globalement
    uint8_t page = y / 8;
    uint8_t bit = y % 8;
    framebuffer[x][page] |= (1 << bit);

    // Positionne le curseur sur la colonne et la page
    ssd1306_write_cmd(i2c_dev, 0x21); // Set column address
    ssd1306_write_cmd(i2c_dev, x);    // Start column
    ssd1306_write_cmd(i2c_dev, x);    // End column
    ssd1306_write_cmd(i2c_dev, 0x22); // Set page address
    ssd1306_write_cmd(i2c_dev, page); // Start page
    ssd1306_write_cmd(i2c_dev, page); // End page

    // Écrit la page entière (tous les bits de la colonne pour cette page)
    ssd1306_write_data(i2c_dev, framebuffer[x][page]);
}

void eteindre_pixel(const struct device *i2c_dev, uint8_t x, uint8_t y) {
    //if (x >= 128 || y >= 64) return;
    //extern uint8_t framebuffer[128][4];
    uint8_t page = y / 8;
    uint8_t bit = y % 8;
    framebuffer[x][page] &= ~(1 << bit);

    ssd1306_write_cmd(i2c_dev, 0x21);
    ssd1306_write_cmd(i2c_dev, x);
    ssd1306_write_cmd(i2c_dev, x);
    ssd1306_write_cmd(i2c_dev, 0x22);
    ssd1306_write_cmd(i2c_dev, page);
    ssd1306_write_cmd(i2c_dev, page);

    ssd1306_write_data(i2c_dev, framebuffer[x][page]);
}


static void ssd1306_init(const struct device *i2c_dev) {
    ssd1306_write_cmd(i2c_dev, 0xAE); // Display OFF
    ssd1306_write_cmd(i2c_dev, 0xD5); // Set display clock divide ratio/oscillator freq
    ssd1306_write_cmd(i2c_dev, 0x80); // Default setting for display clock divide ratio
    ssd1306_write_cmd(i2c_dev, 0xA8); // Set multiplex ratio
    ssd1306_write_cmd(i2c_dev, 0x3F); // 1/32 duty (0x1F pour 32 lignes)
    ssd1306_write_cmd(i2c_dev, 0xD3); // Set display offset
    ssd1306_write_cmd(i2c_dev, 0x00); // No offset
    ssd1306_write_cmd(i2c_dev, 0x40); // Set start line at 0
    ssd1306_write_cmd(i2c_dev, 0x8D); // Enable charge pump regulator
    ssd1306_write_cmd(i2c_dev, 0x14);
    ssd1306_write_cmd(i2c_dev, 0x20); // Set memory addressing mode
    ssd1306_write_cmd(i2c_dev, 0x00); // Horizontal addressing mode
    ssd1306_write_cmd(i2c_dev, 0xA0); // Set segment re-map 0 to 127
    ssd1306_write_cmd(i2c_dev, 0xC0); // Set COM output scan direction remapped
    ssd1306_write_cmd(i2c_dev, 0xDA); // Set COM pins hardware configuration
    ssd1306_write_cmd(i2c_dev, 0x12); // 0x02 pour 128x32 (voir datasheet)
    ssd1306_write_cmd(i2c_dev, 0x81); // Set contrast control
    ssd1306_write_cmd(i2c_dev, 0xCF);
    ssd1306_write_cmd(i2c_dev, 0xD9); // Set pre-charge period
    ssd1306_write_cmd(i2c_dev, 0xF1);
    ssd1306_write_cmd(i2c_dev, 0xDB); // Set VCOMH deselect level
    ssd1306_write_cmd(i2c_dev, 0x40);
    ssd1306_write_cmd(i2c_dev, 0xA4); // Entire display ON (resume)
    ssd1306_write_cmd(i2c_dev, 0xA6); // Set normal display (not inverted)
    ssd1306_write_cmd(i2c_dev, 0xAF); // Display ON
}







// Table ASCII '0'-'9', 'A'-'Z' (0-9 puis A-Z)
static const uint8_t font_5x7[96][5] = {
	{ 0x00, 0x00, 0x00, 0x00, 0x00 },  // 20  32
	{ 0x00, 0x00, 0x4F, 0x00, 0x00 },  // 21  33  !
	{ 0x00, 0x07, 0x00, 0x07, 0x00 },  // 22  34  "
	{ 0x14, 0x7F, 0x14, 0x7F, 0x14 },  // 23  35  #
	{ 0x24, 0x2A, 0x7F, 0x2A, 0x12 },  // 24  36  $
	{ 0x23, 0x13, 0x08, 0x64, 0x62 },  // 25  37  %
	{ 0x36, 0x49, 0x55, 0x22, 0x50 },  // 26  38  &
	{ 0x00, 0x05, 0x03, 0x00, 0x00 },  // 27  39  '
	{ 0x00, 0x1C, 0x22, 0x41, 0x00 },  // 28  40  (
	{ 0x00, 0x41, 0x22, 0x1C, 0x00 },  // 29  41  )
	{ 0x14, 0x08, 0x3E, 0x08, 0x14 },  // 2A  42  *
	{ 0x08, 0x08, 0x3E, 0x08, 0x08 },  // 2B  43  +
	{ 0x00, 0x50, 0x30, 0x00, 0x00 },  // 2C  44  ,
	{ 0x08, 0x08, 0x08, 0x08, 0x08 },  // 2D  45  -
	{ 0x00, 0x60, 0x60, 0x00, 0x00 },  // 2E  46  .
	{ 0x20, 0x10, 0x08, 0x04, 0x02 },  // 2F  47  /
	{ 0x3E, 0x51, 0x49, 0x45, 0x3E },  // 30  48  0
	{ 0x00, 0x42, 0x7F, 0x40, 0x00 },  // 31  49  1
	{ 0x42, 0x61, 0x51, 0x49, 0x46 },  // 32  50  2
	{ 0x21, 0x41, 0x45, 0x4B, 0x31 },  // 33  51  3
	{ 0x18, 0x14, 0x12, 0x7F, 0x10 },  // 34  52  4
	{ 0x27, 0x45, 0x45, 0x45, 0x39 },  // 35  53  5
	{ 0x3C, 0x4A, 0x49, 0x49, 0x30 },  // 36  54  6
	{ 0x03, 0x01, 0x71, 0x09, 0x07 },  // 37  55  7
	{ 0x36, 0x49, 0x49, 0x49, 0x36 },  // 38  56  8
	{ 0x06, 0x49, 0x49, 0x29, 0x1E },  // 39  57  9
	{ 0x00, 0x36, 0x36, 0x00, 0x00 },  // 3A  58  :
	{ 0x00, 0x56, 0x36, 0x00, 0x00 },  // 3B  59  ;
	{ 0x08, 0x14, 0x22, 0x41, 0x00 },  // 3C  60  <
	{ 0x14, 0x14, 0x14, 0x14, 0x14 },  // 3D  61  =
	{ 0x00, 0x41, 0x22, 0x14, 0x08 },  // 3E  62  >
	{ 0x02, 0x01, 0x51, 0x09, 0x06 },  // 3F  63  ?
	{ 0x32, 0x49, 0x79, 0x41, 0x3E },  // 40  64  @
	{ 0x7E, 0x11, 0x11, 0x11, 0x7E },  // 41  65  A
	{ 0x7F, 0x49, 0x49, 0x49, 0x36 },  // 42  66  B
	{ 0x3E, 0x41, 0x41, 0x41, 0x22 },  // 43  67  C
	{ 0x7F, 0x41, 0x41, 0x22, 0x1C },  // 44  68  D
	{ 0x7F, 0x49, 0x49, 0x49, 0x41 },  // 45  69  E
	{ 0x7F, 0x09, 0x09, 0x09, 0x01 },  // 46  70  F
	{ 0x3E, 0x41, 0x49, 0x49, 0x7A },  // 47  71  G
	{ 0x7F, 0x08, 0x08, 0x08, 0x7F },  // 48  72  H
	{ 0x00, 0x41, 0x7F, 0x41, 0x00 },  // 49  73  I
	{ 0x20, 0x40, 0x41, 0x3F, 0x01 },  // 4A  74  J
	{ 0x7F, 0x08, 0x14, 0x22, 0x41 },  // 4B  75  K
	{ 0x7F, 0x40, 0x40, 0x40, 0x40 },  // 4C  76  L
	{ 0x7F, 0x02, 0x0C, 0x02, 0x7F },  // 4D  77  M
	{ 0x7F, 0x04, 0x08, 0x10, 0x7F },  // 4E  78  N
	{ 0x3E, 0x41, 0x41, 0x41, 0x3E },  // 4F  79  O
	{ 0x7F, 0x09, 0x09, 0x09, 0x06 },  // 50  80  P
	{ 0x3E, 0x41, 0x51, 0x21, 0x5E },  // 51  81  Q
	{ 0x7F, 0x09, 0x19, 0x29, 0x46 },  // 52  82  R
	{ 0x46, 0x49, 0x49, 0x49, 0x31 },  // 53  83  S
	{ 0x01, 0x01, 0x7F, 0x01, 0x01 },  // 54  84  T
	{ 0x3F, 0x40, 0x40, 0x40, 0x3F },  // 55  85  U
	{ 0x1F, 0x20, 0x40, 0x20, 0x1F },  // 56  86  V
	{ 0x3F, 0x40, 0x38, 0x40, 0x3F },  // 57  87  W
	{ 0x63, 0x14, 0x08, 0x14, 0x63 },  // 58  88  X
	{ 0x07, 0x08, 0x70, 0x08, 0x07 },  // 59  89  Y
	{ 0x61, 0x51, 0x49, 0x45, 0x43 },  // 5A  90  Z
	{ 0x7F, 0x41, 0x41, 0x00, 0x00 },  // 5B  91  [
	{ 0x15, 0x16, 0x7C, 0x16, 0x15 },  // 5C  92  '\'
	{ 0x00, 0x41, 0x41, 0x7F, 0x00 },  // 5D  93  ]
	{ 0x04, 0x02, 0x01, 0x02, 0x04 },  // 5E  94  ^
	{ 0x40, 0x40, 0x40, 0x40, 0x40 },  // 5F  95  _
	{ 0x00, 0x01, 0x02, 0x04, 0x00 },  // 60  96  `
	{ 0x20, 0x54, 0x54, 0x54, 0x78 },  // 61  97  a
	{ 0x7F, 0x48, 0x44, 0x44, 0x38 },  // 62  98  b
	{ 0x38, 0x44, 0x44, 0x44, 0x20 },  // 63  99  c
	{ 0x38, 0x44, 0x44, 0x48, 0x7F },  // 64 100  d
	{ 0x38, 0x54, 0x54, 0x54, 0x18 },  // 65 101  e
	{ 0x08, 0x7E, 0x09, 0x01, 0x02 },  // 66 102  f
	{ 0x0C, 0x52, 0x52, 0x52, 0x3E },  // 67 103  g
	{ 0x7F, 0x08, 0x04, 0x04, 0x78 },  // 68 104  h
	{ 0x00, 0x44, 0x7D, 0x40, 0x00 },  // 69 105  i
	{ 0x20, 0x40, 0x44, 0x3D, 0x00 },  // 6A 106  j
	{ 0x7F, 0x10, 0x28, 0x44, 0x00 },  // 6B 107  k
	{ 0x00, 0x41, 0x7F, 0x40, 0x00 },  // 6C 108  l
	{ 0x7C, 0x04, 0x18, 0x04, 0x78 },  // 6D 109  m
	{ 0x7C, 0x08, 0x04, 0x04, 0x78 },  // 6E 110  n
	{ 0x38, 0x44, 0x44, 0x44, 0x38 },  // 6F 111  o
	{ 0x7C, 0x14, 0x14, 0x14, 0x08 },  // 70 112  p
	{ 0x08, 0x14, 0x14, 0x18, 0x7C },  // 71 113  q
	{ 0x7C, 0x08, 0x04, 0x04, 0x08 },  // 72 114  r
	{ 0x48, 0x54, 0x54, 0x54, 0x20 },  // 73 115  s
	{ 0x04, 0x3F, 0x44, 0x40, 0x20 },  // 74 116  t
	{ 0x3C, 0x40, 0x40, 0x20, 0x7C },  // 75 117  u
	{ 0x1C, 0x20, 0x40, 0x20, 0x1C },  // 76 118  v
	{ 0x3C, 0x40, 0x38, 0x40, 0x3C },  // 77 119  w
	{ 0x44, 0x28, 0x10, 0x28, 0x44 },  // 78 120  x
	{ 0x0C, 0x50, 0x50, 0x50, 0x3C },  // 79 121  y
	{ 0x44, 0x64, 0x54, 0x4C, 0x44 },  // 7A 122  z
	{ 0x00, 0x08, 0x36, 0x41, 0x00 },  // 7B 123  {
	{ 0x00, 0x00, 0x7F, 0x00, 0x00 },  // 7C 124  |
	{ 0x00, 0x41, 0x36, 0x08, 0x00 },  // 7D 125  }
	{ 0x08, 0x08, 0x2A, 0x1C, 0x08 },  // 7E 126  ~
	{ 0x08, 0x1C, 0x2A, 0x08, 0x08 }   // 7F 127
};


void dessiner_caractere(const struct device *i2c_dev, char c, uint8_t x, uint8_t y, bool erase) {


	if(erase){
    // Effacer la zone 5x7 avant de dessiner le caractère
    for (uint8_t col = 0; col < 5; col++) {
        for (uint8_t row = 0; row < 7; row++) {
            eteindre_pixel(i2c_dev, x + col, y + row);
        }
    }}



    // Affiche tout caractère ASCII 32..127 (inclus)
    if (c < 32 || c > 127) return;
    const uint8_t *bitmap = font_5x7[c - 32];
    for (uint8_t col = 0; col < 5; col++) {
        uint8_t bits = bitmap[col];
        for (uint8_t row = 0; row < 7; row++) {
            if (bits & (1 << row)) {
                allumer_pixel(i2c_dev, x + col, y + row);
            }
        }
    }
}


void clear_display(const struct device *i2c_dev) {

