madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
}

double last_latitude = 0;
double last_longitude = 0;

double ref_latitude2 = 0;
double ref_longitude2 = 0;


int lte_wait = 0;
int lte_quota = 10;


volatile int position=0;
float lat[5];
float lng[5];
time_t ts[5];


#include <zephyr/net/socket.h>


#define HTTP_HOST "plongee.duckdns.org"
#define HTTP_PATH "/targets"
#define HTTP_PATH_LONG "/coords"
#define HTTP_PORT 8545
#define MAX_MTU_SIZE     2000
#define RECV_BUF_SIZE    2048
#define SEND_BUF_SIZE    MAX_MTU_SIZE

#define JSON_TEMPLATE "%ld,%.9f,%.9f"
#define JSON_TEMPLATE_LONG "%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f"


    char send_buf[2000];

bool gps_state = 0;
bool lte_state = 0;












int blocking_send(int fd, uint8_t *buf, uint32_t size, uint32_t flags)
{
    int err;

    do {
        err = send(fd, buf, size, flags);
    } while (err < 0 && (errno == EAGAIN));

    return err;
}

int blocking_connect(int fd, struct sockaddr *local_addr, socklen_t len)
{
    int err;

    do {
        err = connect(fd, local_addr, len);
		LOG_INF("ERROR CONNECT = %d", err);
    } while (err < 0 && errno == EAGAIN);

    return err;
}


#include <zephyr/kernel.h>

struct k_mutex lte_mutex;

void send_to_cloud(){




			lte_lc_connect();

						LOG_INF("5");

struct sockaddr_in local_addr;
    struct addrinfo *res;
    int send_data_len;
    int num_bytes;
    int mtu_size = MAX_MTU_SIZE;
    //char send_buf[SEND_BUF_SIZE];
   
    local_addr.sin_family = AF_INET;
    local_addr.sin_port = htons(0);
    local_addr.sin_addr.s_addr = 0;


	struct addrinfo hints = {
		.ai_family = AF_INET,       //1
		.ai_socktype = SOCK_DGRAM,  //2
        .ai_next = NULL,
        .ai_addr = NULL,
        .ai_protocol = 0   //any protocol
	};

    int err = getaddrinfo(HTTP_HOST, NULL, &hints, &res);
    LOG_INF("getaddrinfo err: %d", err);
	
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);
   


	//for(int i =0;i<5;i++){



    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d", client_fd);
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d", err);


    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d", err);


	if (err >= 0) {

    LOG_INF("Prepare send buffer:");
	
	
	send_data_len = snprintf(send_buf, 2000,
									"POST %s HTTP/1.1\r\n"
                                    "Host: %s\r\n\r\n"
									JSON_TEMPLATE_LONG,
									HTTP_PATH_LONG, HTTP_HOST,
									(long)ts[0], lat[0], lng[0],
									(long)ts[1], lat[1], lng[1],
									(long)ts[2], lat[2], lng[2],
									(long)ts[3], lat[3], lng[3],
									(long)ts[4], lat[4], lng[4]);



    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);


    LOG_INF("Finished. Closing socket");
    err = close(client_fd);

}

    freeaddrinfo(res);
int ret;
  ret = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_DEACTIVATE_LTE);


    if (ret) {
        LOG_ERR("Failed to disconnect from LTE network");
    } else {
        LOG_INF("Disconnected from LTE network");
    }


}

time_t timestamp;

void print_fix_data(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{
/*
	
	printf("Latitude:       %.06f\n", pvt_data->latitude);
	printf("Longitude:      %.06f\n", pvt_data->longitude);
	printf("Altitude:       %.01f m\n", pvt_data->altitude);
	printf("Accuracy:       %.01f m\n", pvt_data->accuracy);
	printf("Speed:          %.01f m/s\n", pvt_data->speed);
	printf("Speed accuracy: %.01f m/s\n", pvt_data->speed_accuracy);
	printf("Heading:        %.01f deg\n", pvt_data->heading);
	printf("Date:           %04u-%02u-%02u\n",
	       pvt_data->datetime.year,
	       pvt_data->datetime.month,
	       pvt_data->datetime.day);
	printf("Time (UTC):     %02u:%02u:%02u.%03u\n",
	       pvt_data->datetime.hour,
	       pvt_data->datetime.minute,
	       pvt_data->datetime.seconds,
	       pvt_data->datetime.ms);
	printf("PDOP:           %.01f\n", pvt_data->pdop);
	printf("HDOP:           %.01f\n", pvt_data->hdop);
	printf("VDOP:           %.01f\n", pvt_data->vdop);
	printf("TDOP:           %.01f\n", pvt_data->tdop);
*/

	struct tm tm;

	tm.tm_year = pvt_data->datetime.year - 1900;
	tm.tm_mon = pvt_data->datetime.month - 1;
	tm.tm_mday = pvt_data->datetime.day;
	tm.tm_hour = pvt_data->datetime.hour;
	tm.tm_min = pvt_data->datetime.minute;
	tm.tm_sec = pvt_data->datetime.seconds;
	tm.tm_isdst = 0;


		timestamp = mktime(&tm);

		last_latitude = pvt_data->latitude;
		last_longitude = pvt_data->longitude;

		}

void initial_connexion(){

	int err;

	lte_lc_connect();
		if (err) {
			LOG_ERR("Failed to connect to LTE network, error: %d", err);
			return err;
		}

		LOG_INF("Connected to LTE network");

	struct sockaddr_in local_addr;
    struct addrinfo *res;
    int send_data_len;
    int num_bytes;
    int mtu_size = MAX_MTU_SIZE;
   
    local_addr.sin_family = AF_INET;
    local_addr.sin_port = htons(0);
    local_addr.sin_addr.s_addr = 0;


	struct addrinfo hints = {
		.ai_family = AF_INET,       //1
		.ai_socktype = SOCK_DGRAM,  //2
        .ai_next = NULL,
        .ai_addr = NULL,
        .ai_protocol = 0   //any protocol
	};

    err = getaddrinfo(HTTP_HOST, NULL, &hints, &res);
    LOG_INF("getaddrinfo err: %d", err);
	
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);
   

    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d", client_fd);
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d", err);


    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d", err);


	if (err >= 0) {

    LOG_INF("Prepare send buffer:");

	
		uint8_t x = 0, y = 8;

		char line[128];
		snprintf(line,sizeof(line),"Connecting...");
		for (const char *p = line; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,1);
			x += 6;

