madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
		}



	send_data_len = snprintf(send_buf, 2000,
                                     "GET %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n",
                                     HTTP_PATH, HTTP_HOST);



    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	char recv_buf[RECV_BUF_SIZE] = {0};
	int tot_num_bytes = 0;

	do {
		/* TODO: make a proper timeout *
		 * Current solution will just hang 
		 * until remote side closes connection */
		num_bytes = recv(client_fd, recv_buf, RECV_BUF_SIZE, 0);
		tot_num_bytes += num_bytes;
                LOG_INF("total number of bytes: %d\n", tot_num_bytes);
                LOG_INF("num bytes: %d\n", num_bytes);
		if (num_bytes < 0) {
			LOG_INF("\nrecv errno: %d\n", errno);
			break;
		}
		//LOG_INF("%s\n", recv_buf);
	} while (num_bytes > 0);


    double values[10];                       // Tableau pour stocker les doubles
    size_t count = 0;


    char *token = strtok(recv_buf, ",");
    while (token != NULL && count < 10) {
        values[count] = strtod(token, NULL);  // Conversion vers double
        count++;
        token = strtok(NULL, ",");
    }

	targets_count = (count/2);

		x = 0;
		y = 16;

		snprintf(line, sizeof(line),"%d targets",targets_count);
		for (const char *p = line; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,1);
			x += 6;

		}

    // Afficher les résultats
    for (size_t i = 0; i < targets_count*2; i++) {
		targets[i] = values[i];
    }

    LOG_INF("Finished. Closing socket");
    err = close(client_fd);

}

    freeaddrinfo(res);
	err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_DEACTIVATE_LTE);
	lte_state = 0;

}


#include <zephyr/dfu/mcuboot.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/sys/crc.h>
#include <zephyr/storage/flash_map.h>
#include <zephyr/dfu/flash_img.h>

void flash_firmware(){

	int err;

	lte_lc_connect();
		if (err) {
			LOG_ERR("Failed to connect to LTE network, error: %d", err);
			return err;
		}

		LOG_INF("Connected to LTE network");

		

	struct flash_img_context fic;

	struct sockaddr_in local_addr;
    struct addrinfo *res;
    int send_data_len;
    int num_bytes;
    int mtu_size = MAX_MTU_SIZE;
   
    local_addr.sin_family = AF_INET;
    local_addr.sin_port = htons(0);
    local_addr.sin_addr.s_addr = 0;


	struct addrinfo hints = {
		.ai_family = AF_INET,       //1
		.ai_socktype = SOCK_DGRAM,  //2
        .ai_next = NULL,
        .ai_addr = NULL,
        .ai_protocol = 0   //any protocol
	};



	flash_img_init_id(&fic, PM_MCUBOOT_SECONDARY_ID); // Or appropriate slot ID
	boot_erase_img_bank(PM_MCUBOOT_SECONDARY_ID);

	
    err = getaddrinfo(HTTP_HOST, NULL, &hints, &res);	
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);

    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));

	if (err >= 0) {
	
	send_data_len = snprintf(send_buf, 2000,
                                     "GET %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n",
                                     "/firmware", HTTP_HOST);



    do {
        num_bytes = blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	char recv_buf[RECV_BUF_SIZE];
	int tot_num_bytes = 0;

	do {
		/* TODO: make a proper timeout *
		 * Current solution will just hang 
		 * until remote side closes connection */
		num_bytes = recv(client_fd, recv_buf, RECV_BUF_SIZE, 0);
		tot_num_bytes += num_bytes;
                LOG_INF("total number of bytes: %d\n", tot_num_bytes);
                LOG_INF("num bytes: %d\n", num_bytes);


		err = flash_img_buffered_write(&fic, recv_buf, num_bytes, false);
        if (err) {
            printk("Erreur écriture flash: %d\n", err);
            break;
        }
		
				
		if (num_bytes < 0) {
			LOG_INF("\nrecv errno: %d\n", errno);
			break;
		}
	} while (num_bytes > 0);

	}


	// Flush final pour s'assurer que tout est écrit
	err = flash_img_buffered_write(&fic, NULL, 0, true);
	if (err) {
		printk("Erreur flush final: %d\n", err);
	}

	boot_request_upgrade(BOOT_SWAP_TYPE_PERM);
	sys_reboot(SYS_REBOOT_COLD);


}














#include <zephyr/drivers/sensor.h>





















static float sensor_value_to_float(const struct sensor_value *val)
{
    return (float)val->val1 + (val->val2 / 1000000.0f);
}
 




volatile float avg = 0;
float thresold = 19;
int reset_threshold = 20;

int refresh_rate = 1000;
int confirmation_rate = 20;



int menu = -1;
int tap_state = 0;
//int reset_state = 0;
int confirmation_state = 0;



const char *menu_str[] = {
    "EXIT MENU",
	"GPS:",
    "LTE:",
	"RELOAD COORDINATES",
	"FW UPDATE",
	"OFF"
};
int nb_menu = 6;







K_THREAD_STACK_DEFINE(accelerometer_stack, 1024);
K_THREAD_STACK_DEFINE(tap_stack, 1024);
K_THREAD_STACK_DEFINE(gps_stack, 1024);

struct k_thread accelerometer_data;
struct k_thread tap_data;
struct k_thread gps_data;




int measure_rate = 10;

float valuex = 0;
float valuey = 0;
float valuez = 0;



void accelerometer_thread(void *a, void *b, void *c) {

	const struct device *lis2dh = (const struct device *)a;

    while (1) {

		struct sensor_value accel[3];
		if (sensor_sample_fetch(lis2dh) < 0) {
			LOG_INF("Erreur lors de la récupération des données du capteur\n");
			return;
		}

		if (sensor_channel_get(lis2dh, SENSOR_CHAN_ACCEL_XYZ, accel) < 0) {
			LOG_INF("Erreur lors dze la récupération des données du capteur\n");
			return;
		}

		float ax = sensor_value_to_float(&accel[0]);
		float ay = sensor_value_to_float(&accel[1]);
		float az = sensor_value_to_float(&accel[2]);


		avg += sqrtf(ax*ax+ay*ay+az*az)-9.8;


