madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
		valuex = ax*ax;
		valuey = ay*ay;
		valuez = az*az;


		k_sleep(K_MSEC(measure_rate));

    }
}


int tap_reset_rate = 10;
int tap_threshold = 35;
int tap_kickback_waittime = 100;



int confirmation_timeout = 30;

int multitap = 0;

int bypass = 0;

void tap_thread(void *a, void *b, void *c) {

	int reset_state = 0;

	while(1){


		if(reset_state >= reset_threshold){

			reset_state = 0;
			avg = 0;
			tap_state = 0;


			
		}

		if(fabs(avg) > tap_threshold){
			LOG_INF("TAPPED %.2f",valuex);



			tap_state = 1;
			reset_state = reset_threshold;
			k_sleep(K_MSEC(tap_kickback_waittime));
		}

		k_sleep(K_MSEC(tap_reset_rate));
		reset_state += 1;
	}
}




uint32_t last_fix = 0;







int gps_rate = 500;



void gps_thread(void *a, void *b, void *c) {



while(true){

							k_mutex_lock(&lte_mutex, K_FOREVER);
//for (;;) {
//		(void)k_poll(events, 2, K_FOREVER);

			//LOG_INF("%d %d",events[0].state,K_POLL_STATE_SEM_AVAILABLE);
		//if (events[0].state == K_POLL_STATE_SEM_AVAILABLE &&
		//    k_sem_take(events[0].sem, K_NO_WAIT) == 0) {

			print_satellite_stats(&last_pvt);

			if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
							fix_timestamp = k_uptime_get();
							print_fix_data(&last_pvt);
							//print_distance_from_reference(&last_pvt);


						} else {

							last_fix = (uint32_t)((k_uptime_get() - fix_timestamp) / 1000);

						}



		//	}

								k_mutex_unlock(&lte_mutex);
	k_sleep(K_MSEC(gps_rate));

}



}









void exit_menu(const struct device *i2c_dev){

	menu = -1;
	clear_display2(i2c_dev);

}

void change_gps(const struct device *i2c_dev){

uint8_t x = 5*6, y = 8;
char message[128];
if(gps_state == 0){
	gps_state = 1;
	snprintf(message, sizeof(message), " ON ");
						}else{
							gps_state = 0;
							snprintf(message, sizeof(message), " OFF");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
}

void change_lte(const struct device *i2c_dev){

uint8_t x = 5*6, y = 16;
char message[128];
if(lte_state == 0){
	lte_state = 1;
	snprintf(message, sizeof(message), " ON ");
						}else{
							lte_state = 0;
							snprintf(message, sizeof(message), " OFF");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
}

void clear_display2(const struct device *i2c_dev) {
    // 1. Efface le framebuffer RAM
    memset(framebuffer, 0, sizeof(framebuffer));

    // 2. Pour chaque page, envoie 128 zéros d'un coup
    uint8_t zeros[128] = {0};
    for (uint8_t page = 0; page < 8; page++) {
        ssd1306_write_cmd(i2c_dev, 0x21); // Set column address
        ssd1306_write_cmd(i2c_dev, 0);    // Start column
        ssd1306_write_cmd(i2c_dev, 127);  // End column
        ssd1306_write_cmd(i2c_dev, 0x22); // Set page address
        ssd1306_write_cmd(i2c_dev, page); // Start page
        ssd1306_write_cmd(i2c_dev, page); // End page

        // Envoie 128 octets d'un coup (plus rapide que 128 appels séparés)
        uint8_t buf[129];
        buf[0] = 0x40; // Control byte for data
        memset(&buf[1], 0, 128);
        i2c_write(i2c_dev, buf, sizeof(buf), SSD1306_I2C_ADDR);
    }
}





volatile int first = 0;



void reload_coordinates(const struct device *i2c_dev){

	if(lte_state == 0){return; }

	clear_display2(i2c_dev);


	uint8_t x = 5*6, y = 16;
	
	int err;
	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;

	x=0;
	y=0;

		char line[128];
		snprintf(line,sizeof(line),"Initialization...");
		for (const char *p = line; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,0);
			x += 6;

		}









	lte_lc_init();
	lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_LTEM_GPS,LTE_LC_SYSTEM_MODE_PREFER_LTEM);

	initial_connexion();


	menu = -1;
	bypass = 1;
	multitap = 1;
	first = 0;

}









void firmware_update(const struct device *i2c_dev){


if(lte_state == 0){return; }

	clear_display2(i2c_dev);


	uint8_t x = 5*6, y = 16;
	
	int err;
	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;


	x=0;
	y=0;

		char line[128];
		snprintf(line,sizeof(line),"Initialization...");
		for (const char *p = line; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,0);
			x += 6;

		}









	lte_lc_init();
	lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_LTEM_GPS,LTE_LC_SYSTEM_MODE_PREFER_LTEM);

	flash_firmware();


	menu = -1;
	bypass = 1;
	multitap = 1;

}







#include <zephyr/sys/reboot.h>

uint32_t ref_lastfix = 0;

void ssd1306_power_off(const struct device *i2c_dev) {
    ssd1306_write_cmd(i2c_dev, 0xAE); // Display OFF
}

void ssd1306_power_on(const struct device *i2c_dev) {
    ssd1306_write_cmd(i2c_dev, 0xAF); // Display ON
}

void off(const struct device *i2c_dev){

	ssd1306_power_off(i2c_dev);

	gps_rate = 60000;
	refresh_rate = 60000;
	confirmation_rate = 60000;

	while(tap_state == 0){


		k_sleep(K_SECONDS(5));

	}

	gps_rate = 500;
	refresh_rate = 1000;
	confirmation_rate = 20;

	ssd1306_power_on(i2c_dev);

}


int main(void)
{

k_mutex_init(&lte_mutex);

		uint8_t x = 0, y = 0;
		int j = 0;

char message[128];


	//const struct device *i2c_dev = DEVICE_DT_GET(DT_NODELABEL(i2c1));
	if (!device_is_ready(i2c_dev)) {
		LOG_ERR("I2C device not ready");
		sys_reboot(SYS_REBOOT_COLD);
	}
	LOG_INF("I2C device is ready");

	clear_display2(i2c_dev); // Efface l'écran avant de dessiner
    ssd1306_init(i2c_dev); // <-- Ajoute cette ligne ici




		snprintf(message, sizeof(message), "FW_version 3");
	

		x = 0;
		y = 0;
		for (const char *p = message; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,0);
			x += 6;

		}

	k_sleep(K_SECONDS(5));
	clear_display2(i2c_dev); // Efface l'écran avant de dessiner







    const struct device *lis2dh = DEVICE_DT_GET_ONE(st_lis2dh);

    if (!device_is_ready(lis2dh)) {
        LOG_ERR("Erreur : LIS2DH non prêt\n");
        sys_reboot(SYS_REBOOT_COLD);
    }

	k_thread_create(&accelerometer_data, accelerometer_stack, 1024,accelerometer_thread, (void *)lis2dh, NULL, NULL,5, 0, K_NO_WAIT);
	k_thread_create(&tap_data, tap_stack, 1024,tap_thread, NULL, NULL, NULL,5, 0, K_NO_WAIT);
	k_thread_create(&gps_data, gps_stack, 1024,gps_thread, NULL, NULL, NULL,5, 0, K_NO_WAIT);





	int err;
	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;


