madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Modem library initialization failed, error: %d", err);
		sys_reboot(SYS_REBOOT_COLD);
	}

	lte_lc_init();
	lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_LTEM_GPS,LTE_LC_SYSTEM_MODE_PREFER_LTEM);








	/* Initialize reference coordinates (if used). */
	if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
	    sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1) {
		ref_used = true;
		ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
		ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	}

	if (modem_init() != 0) {
		LOG_ERR("Failed to initialize modem");
		return -1;
	}

	if (sample_init() != 0) {
		LOG_ERR("Failed to initialize sample");
		return -1;
	}

	if (gnss_init_and_start() != 0) {
		LOG_ERR("Failed to initialize and start GNSS");
		return -1;
	}

	fix_timestamp = k_uptime_get();

	lte_lc_init();











	multitap = 0;
	int confirmation = 0;



	while(true){


		
	if(menu == -1){

				if(first == 0){
					
		snprintf(message, sizeof(message), "T: %2d U: %2d Un: %d", 0, 0, 0);

		x = 0;
		y = 0;
		for (const char *p = message; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,1);
			x += 6;

		}

		y=8;
		x=0;
		snprintf(message, sizeof(message), "Last fix: %d   ",0);


		for (const char *p = message; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,1);
			x += 6;

		}


		x = 0; 
		y = 32;


		for(int i=0;i<targets_count;i++){

			int heading, distance;


			snprintf(message, sizeof(message), "%1d:     DEG  |       m", i+1, heading, distance);

			for (const char *p = message; *p; p++) {
				dessiner_caractere(i2c_dev, *p, x, y,1);
			x += 6;

		}

			y+= 8;
			x = 0;
		}


				}



				if(last_fix != ref_lastfix){
					ref_lastfix = last_fix;
					y=8;
					x=10*6;

					snprintf(message, sizeof(message), "%d   ",last_fix);
					for (const char *p = message; *p; p++) {
						dessiner_caractere(i2c_dev, *p, x, y,1);
						x += 6;

					}
		
				}

				if(gps_state == 1 || first == 0){

					first = 1;
					y = 0;

					if(last_tracked != gps_tracking){

						snprintf(message, sizeof(message), "%2d", gps_tracking);

						x=3*6;

						for (const char *p = message; *p; p++) {
							dessiner_caractere(i2c_dev, *p, x, y,1);
							x += 6;
						}

						last_tracked = gps_tracking;

					}

					if(last_in_fix != gps_using){

						snprintf(message, sizeof(message), "%2d", gps_using);

						x=9*6;

						for (const char *p = message; *p; p++) {
							dessiner_caractere(i2c_dev, *p, x, y,1);
							x += 6;
						}

						last_in_fix = gps_using;
					}

					if(last_unhealthy != gps_unk){

					snprintf(message, sizeof(message), "%2d", gps_unk);


					x=16*6;

					for (const char *p = message; *p; p++) {
						dessiner_caractere(i2c_dev, *p, x, y,1);
						x += 6;
					}

						last_unhealthy = gps_unk;

					}

	//uint8_t x = 0, y = 32;
	char linex[128];




					if(lte_state == 1 && gps_using >= 4){

					if(position >= 5*20){

						position = 0;

						k_mutex_lock(&lte_mutex, K_SECONDS(60));

						send_to_cloud();

						k_mutex_unlock(&lte_mutex);

					}

					if((position+20) % 20 == 0){
					ts[position/20] = timestamp;
					lat[position/20] = last_latitude;
					lng[position/20] = last_longitude;

					}

					position++;
		


					}





	if(fabs(ref_latitude2 - last_latitude) > 0.00001 || fabs(ref_longitude2 - last_longitude) > 0.00001){

		ref_latitude2 = last_latitude;
		ref_longitude2 = last_longitude;


		x = 0; 
		y = 32;

		for(int i=0;i<targets_count;i++){

			int heading, distance;

			calcul_cap_distance_int(last_latitude, last_longitude, targets[i*2], targets[i*2+1], &heading, &distance);

			if(distance > 10000){
				distance = 9999;
			}


			x = 3*6;



			snprintf(linex, sizeof(linex), "%3d", heading);
			for (const char *p = linex; *p; p++) {
				dessiner_caractere(i2c_dev, *p, x, y,1);
			x += 6;
			}

			x = 14*6;
			snprintf(linex, sizeof(linex), "%4d", distance);
			for (const char *p = linex; *p; p++) {
				dessiner_caractere(i2c_dev, *p, x, y,1);
			x += 6;
			}

			y+= 8;
			x = 0;
		}










}

				}

		}


		if(tap_state == 1 || bypass == 1){

			bypass = 0;
			multitap += 1;


			if(menu == -1){

				multitap = 0;
				LOG_INF("GOING IN THE MENU");
				menu = 0;



				clear_display2(i2c_dev);
				y=0;

				for(int i=0;i<nb_menu;i++){

					LOG_INF("%s",menu_str[i]);
					snprintf(message, sizeof(message), menu_str[i]);


		
				x = 6;
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,0);
					x += 6;

				}

				if(i == 1){

						if(gps_state == 0){
							snprintf(message, sizeof(message), " OFF");
						}else{
							snprintf(message, sizeof(message), " ON ");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,0);
					x += 6;

				}
					}
					if(i == 2){

						if(lte_state == 0){
							snprintf(message, sizeof(message), " OFF");
						}else{
							snprintf(message, sizeof(message), " ON ");
						}

										for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,0);
					x += 6;

				}
					}






				y += 8;


				}


				//Remettre le nouveau caractère
				snprintf(message, sizeof(message), ">");
				x = 0;
				y = 0;
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,0);
					x += 6;

				}

				confirmation = 0;

			}
			if(menu != -1 && multitap == 1){

				multitap = 0;
				confirmation = 0;
				
				//effacer le caractère
				snprintf(message, sizeof(message), " ");
				x = 0;
				y = menu*8;
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
				//Changer la position
				menu = (menu + 1 + nb_menu) % nb_menu;

				//Remettre le nouveau caractère
				snprintf(message, sizeof(message), ">");
				x = 0;
				y = menu*8;
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,0);
					x += 6;

				}
					

			}




		
		}


		if(menu != -1 && confirmation >= confirmation_timeout){

				multitap = 0;
				confirmation = 0;

				LOG_ERR("MENU CHOISI: %s",menu_str[menu]);


				switch(menu){

					case 0: 
							exit_menu(i2c_dev);
							first = 0;
							last_tracked = 0;
							last_fix = 0;
							last_in_fix = 0;
							last_unhealthy = 0;
							last_latitude = 0;
							last_longitude = 0;
							break;
					case 1: 
							change_gps(i2c_dev);
									first = 0;
							break;
					case 2:
							change_lte(i2c_dev);
									first = 0;
							break;
					case 3:
							reload_coordinates(i2c_dev);
									first = 0;
							break;
					case 4:
							flash_firmware();
							break;
					case 5:
							off(i2c_dev);
							break;
				}




			}

		k_sleep(K_MSEC(100));	
		confirmation += 1;	


	}

	return 0;
}
